{
	"ident": 1016,
	"order": 16385,
	"objtype": "kText",
	"properties": {
		"align": "kLeftJst",
		"backcolor": "kColorBackFill",
		"backpattern": 15,
		"designactive": true,
		"edgefloat": "kEFrightBottom",
		"fieldstyle": "CtrlLabelLarge",
		"font": 7,
		"fontsize": 0,
		"fontstyle": "kPlain",
		"forecolor": "kColorForeFill",
		"height": 603,
		"left": 6,
		"objlink": 0,
		"text": {
			"type": 14,
			"calc": "\u001B\u000200000001#THE PURPOSE OF THE NEW FONT MAP\u001B\u000200000000#\r- Provide alternative font names for exporting to HTML\r- To map unknown font names from other platforms or programs\r- To limit OWrite to the specified set of fonts\r\r\u001B\u000200000001#ALTERNATIVE FONTS FOR HTML EXPORT\u001B\u000200000000#\rIt is common practice when specifying font family names in HTML to specify a list of alternative names in a comma separated list. A browser will typically choose the first font in that list which is available on the client's platform. When exporting OWrite documents to HTML, OWrite will use the line from the map that contains the font name to be exported in the left-most column of the map. For example, if row two contains the font in third place and row five contains the font in second place, OWrite will pick row five as the list of font names for export to HTML.\r\r\u001B\u000200000001#MAPPING UNKNOWN FONT NAMES\u001B\u000200000000#\rWhen loading or importing documents from other platforms or programs or pasting content from the clipboard, the documents or content may contain font names unknown to this platform. OWrite will first search for the font in the system, comparing it with the systems family and postscript names of each font and typeface. If this search fails, OWrite will consult the font map and use the row that contains the font name in the left-most column (see 'Alternative Fonts...'). If this second search also fails, OWrite will use the first row in the map to choose the first available font starting from the left. If no font-map is provided, OWrite will use as its default font the font specified in the $font property.\r\u001B\u000200000001#\rLIMIT OWRITE TO THE SPECIFIED FONTS\u001B\u000200000000#\rWhen loading the font-map via the method $loadfontmap one can tell OWrite to limit the fonts that can be used in a document to the fonts specified in the map. When loading OWrite documents or importing documents via RTF or pasting content from the clipboard, OWrite will only allow fonts specified in the map. If fonts are encountered that are not specified in the map, OWrite will use the fonts specified in the first row of the map and pick the first one that exists on the clients system."
		},
		"textcolor": "kColorWindowText",
		"top": 7,
		"userinfo": "",
		"vertcentertext": false,
		"visible": true,
		"width": 655
	}
}
